
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр <> Неопределено Тогда
		Элементы.Список.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("Категория") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Категория", Параметры.Категория);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Категория", Справочники.БЗ_КатегорииБазыЗнаний.ПустаяСсылка());
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Элементы.Пользователь.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Пользователь", Параметры.Пользователь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	РегистрыСведений.БЗ_СостояниеСтатейБазыЗнаний.УстановитьУсловноеОформлениеСписка(Список.УсловноеОформление.Элементы);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.ТолькоПросмотр Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ПоказатьЗначение(, ТекДанные.СтатьяБазыЗнаний);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
