

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОписаниеИзменений = Параметры.БЗ_ОписаниеИзменений;
КонецПроцедуры


&НаКлиенте
Процедура ВыдатьНаИзучениеЗаново(Команда)
	ЗакрытьФормуСПараметрами(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСохранить(Команда)
	ЗакрытьФормуСПараметрами(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСПараметрами(ВыдатьНаИзучениеЗаново)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеИзменений) Тогда
		Сообщить("Обязательно опишите внесённые изменения");
		Возврат;
	КонецЕсли;   
			
	ЗакрытиеРазрешено = Истина;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("БЗ_ОписаниеИзменений", ОписаниеИзменений);
	ПараметрыЗакрытия.Вставить("ВыдатьНаИзучениеЗаново", ВыдатьНаИзучениеЗаново);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ(НЕ ЗавершениеРаботы И ЗакрытиеРазрешено);
КонецПроцедуры

//+++ АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5  
&НаКлиенте
Процедура СохранитьБезКомментария(Команда)
	ЗакрытьФормуБезПараметров(Ложь); 
КонецПроцедуры //--- АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5

//+++ АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5  
//Сохраняем статью с изменениями, без указания комментария и выдачи на повторное изучение
&НаКлиенте
Процедура ЗакрытьФормуБезПараметров(ВыдатьНаИзучениеЗаново)
	
	ОписаниеИзменений = "";
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("БЗ_ОписаниеИзменений", ОписаниеИзменений);
	ПараметрыЗакрытия.Вставить("ВыдатьНаИзучениеЗаново", ВыдатьНаИзучениеЗаново);
	
	ЗакрытиеРазрешено = Истина;
	Закрыть(ПараметрыЗакрытия);

КонецПроцедуры //--- АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5

//+++ АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5
//  По кнопке Отмена закрывается окно для внесения комментария, возвращаемся в окно редактирования статьи
//  то, что было отредактировано остается до сохранения изменений или отказа от сохранения 
&НаКлиенте
Процедура Отмена(Команда)
	
	ЗакрытиеРазрешено = Истина;
	ПараметрыЗакрытия = Новый Структура("НажатаОтмена", Истина);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры //--- АйТи ШариковаТВ от 06.05.2022 ТЗ№ ИС00-002851 e1cib/data/Документ.ЗаданиеНаРаботу?ref=a919fc3497141b3f11ecc4726253e9a5
