// Формирует массив описаний возможных типов контактов
// 
// Возвращаемое значение:
//   ФиксированныйМассив из см. ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта
//
Функция КонтактыВзаимодействий() Экспорт

	Результат = Новый Массив();
	
	Контакт = БЗ_ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.Пользователи");
	Контакт.Имя = "Пользователи";
	Контакт.Представление = НСтр("ru = 'Пользователи'");
	Контакт.ВозможностьИнтерактивногоСоздания = Ложь;
	Контакт.ИскатьПоДомену = Ложь;
	Результат.Добавить(Контакт);
	
	БЗ_ВзаимодействияКлиентСерверПереопределяемый.ПриОпределенииВозможныхКонтактов(Результат);
	Возврат Новый ФиксированныйМассив(Результат);

КонецФункции