// Процедура открывает форму проверки правописания.
//
// Параметры:
//	ПроверяемыйТекст	- Строка			- Проверяемый текст.
//	Вложения			- Структура			- Структура вложений.
//	ИмяРеквизита		- Строка			- Имя реквизита формы, в котором содержится проверяемый текст.
//	Форма				- ФормаКлиентскогоПриложения	- Управляемая форма.
//
Процедура ПроверитьПравописаниеТекста(ПроверяемыйТекст, Вложения,  ИмяРеквизита, Форма) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроверяемыйТекст",	ПроверяемыйТекст);
	ПараметрыФормы.Вставить("Вложения",			Вложения);
	ПараметрыФормы.Вставить("ИмяРеквизита",		ИмяРеквизита);
	ОткрытьФорму("ОбщаяФорма.БЗ_ПроверкаПравописания", ПараметрыФормы, Форма, ,);
КонецПроцедуры // ПроверитьПравописаниеТекста()