
&Вместо("КодировкаВерсииФайла")
Функция БЗ_КодировкаВерсииФайла(ВерсияСсылка)
	Если ТипЗнч(ВерсияСсылка) = Тип("СправочникСсылка.БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы") Или ТипЗнч(ВерсияСсылка) = Тип("СправочникСсылка.БЗ_ВерсииФайлов") Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		МенеджерЗаписи = РегистрыСведений.БЗ_КодировкиФайлов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Файл = ВерсияСсылка;
		МенеджерЗаписи.Прочитать();
		
		Возврат МенеджерЗаписи.Кодировка;
	Иначе 
		Результат = ПродолжитьВызов(ВерсияСсылка);
		Возврат Результат;
	КонецЕсли;
	
КонецФункции
