
Функция ПолучитьТекстСтраницы(знач ДанныеСсылки) Экспорт
	
	Если ТипЗнч(ДанныеСсылки) = Тип("Строка") Тогда
		ДанныеСсылки = БЗ_БазаЗнанийAPIКлиентСервер.РазобратьАдресСсылки(ДанныеСсылки);
	КонецЕсли;
	
	Если НЕ ДанныеСсылки.Команда = "page" Тогда
		Возврат "";
	КонецЕсли;
	
	ОбщиеФайлы		= БЗ_БазаЗнанийHTMLКлиентСервер.ПолучитьОбщиеФайлы();
	ПараметрыСсылки = ДанныеСсылки.Параметры;
	ДопПараметры	= Неопределено;
	
	Если ПараметрыСсылки.name = "home" Тогда
		ДанныеСтраницы	= БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеГлавнойСтраницы(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "category" Тогда
		ДанныеСтраницы	= БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыКатегория(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "article" Тогда
		ДанныеСтраницы	= БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыСтатья(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "tag" Тогда
		ДанныеСтраницы	= БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыКлючевоеСлово(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "featured_articles" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "recently_added" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры); 
	ИначеЕсли ПараметрыСсылки.name = "most_popular" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "top_rated" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "user" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПользователь(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыНовостнаяЛента(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news_item" Тогда
		ДанныеСтраницы = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыНовости(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	Иначе 
		ДанныеСтраницы = Новый Структура("Контент, Картинки, Стили, Заголовок", "", Неопределено, "", "");
	КонецЕсли;
	
	ОсноваСтраницы = БЗ_БазаЗнанийHTMLКлиентСервер.ПолучитьОсновуСтраницы(
		ОбщиеФайлы.Картинки,
		ОбщиеФайлы.Скрипты,
		ДанныеСтраницы.Заголовок);
		
	ТекстHTML = СтрЗаменить(ОсноваСтраницы, "[[ОсновнойКонтент]]", ДанныеСтраницы.Контент);
	//+++ АйТи КучеровРМ 06.11.2018 ТЗ № ИС00-002921
	Если ПараметрыСсылки.name = "category" Тогда
		ТекстHTML = СтрЗаменить(ТекстHTML, 
		".article_s .head h2 a {color:#3f5e20; font-weight:400; text-decoration:none; font-size:13px; line-height:18px;}", 
		".article_s .head h2 a {color:#3f5e20; font-weight:400; text-decoration:none; font-size:13px; line-height:18px; font-weight: bold;}"); // Заголовки статей жирным шрифтом
	КонецЕсли; 
	//--- АйТи КучеровРМ 06.11.2018 ТЗ № ИС00-002921
	БЗ_БазаЗнанийHTMLКлиентСервер.ОбработатьДополнительныеКартинки(ДанныеСтраницы.Картинки);
	
	Возврат ТекстHTML;
	
КонецФункции

Функция ПолучитьЧастьСтраницыОбновления(знач ДанныеСсылки) Экспорт
	
	Если ТипЗнч(ДанныеСсылки) = Тип("Строка") Тогда
		ДанныеСсылки = БЗ_БазаЗнанийAPIКлиентСервер.РазобратьАдресСсылки(ДанныеСсылки);
	КонецЕсли;
	
	Если НЕ ДанныеСсылки.Команда = "refresh" Тогда
		Возврат "";
	КонецЕсли;
	
	ОбщиеФайлы		= БЗ_БазаЗнанийHTMLКлиентСервер.ПолучитьОбщиеФайлы();
	ПараметрыСсылки = ДанныеСсылки.Параметры;
	ДопПараметры	= Неопределено;
	
	Если ПараметрыСсылки.name = "comments" Тогда
		ТекстHTML = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновлениеКомментариев(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news" Тогда
		ТекстHTML = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновлениеНовостнойЛенты(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "articles" Тогда
		ТекстHTML = БЗ_БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновленияСтатей(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	Иначе 
		ТекстHTML = "";
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции
