//Процедура БЗ_ПодключитьОбработчикОжиданияОповещенияПользователя();
//	ПодключитьОбработчикОжидания("БЗ_ОбработатьОповещенияПользователя", 5, Ложь);
//КонецПроцедуры

Процедура БЗ_ОбработатьОповещенияПользователя() Экспорт
	
	ОтключитьОбработчикОжидания("БЗ_ОбработатьОповещенияПользователя");

	ТекущийПользователь = БЗ_БазаЗнанийКлиентСерверПовтИсп.ТекущийПользователь();
	
	МассивОповещений = БЗ_БазаЗнанийВызовСервера.ПолучитьОповещенияПользователя(ТекущийПользователь, 1);
	Если МассивОповещений <> Неопределено Тогда
	
		Идентификаторы = Новый Массив;
		Для Каждого Структура Из МассивОповещений Цикл
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Структура.Объект);
			
			БЗ_Пояснение = "Перейти к ";
			Если ТипЗнч(Структура.Объект) = Тип("СправочникСсылка.БЗ_КомментарииБазыЗнаний") Тогда
				БЗ_Пояснение = БЗ_Пояснение + "комментарию";
			ИначеЕсли ТипЗнч(Структура.Объект) = Тип("СправочникСсылка.БЗ_СтатьиБазыЗнаний") Тогда
				БЗ_Пояснение = БЗ_Пояснение + "статье";
			КонецЕсли;
			
			ПоказатьОповещениеПользователя(Структура.Описание, НавигационнаяСсылка, БЗ_Пояснение, БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Важное);
			Идентификаторы.Добавить(Структура.Идентификатор);
		КонецЦикла;
		
		БЗ_БазаЗнанийВызовСервера.УдалитьОповещенияПользователя(ТекущийПользователь, 1, Идентификаторы);
		
	КонецЕсли;

	ПодключитьОбработчикОжидания("БЗ_ОбработатьОповещенияПользователя", 5, Ложь);
	
КонецПроцедуры