
&После("ПриОпределенииСправочниковХраненияФайлов")
Процедура БЗ_ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников)
	
	БЗ_ПриОпределенииСправочниковХраненияФайловТипыВладельца(ТипВладелецФайла, ИменаСправочников);
	
КонецПроцедуры

Процедура БЗ_ПриОпределенииСправочниковХраненияФайловТипыВладельца(ТипВладелецФайла, ИменаСправочников)
	
	Если ТипВладелецФайла = Тип("СправочникСсылка.БЗ_СтатьиБазыЗнаний") Тогда
		ИменаСправочников.Вставить("БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы", Истина);
	КонецЕсли;
	
КонецПроцедуры