
&НаКлиенте
Процедура БЗ_ИдентификаторКлиентаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПроверитьИдентификатор(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИдентификатор(Текст)
	Если СтрНайти(Текст, " ") > 0 Тогда
		НаборКонстант.БЗ_ИдентификаторКлиента = "";
		Сообщить("Укажите верный идентификатор (без пробелов)", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьИдентификатор(НаборКонстант.БЗ_ИдентификаторКлиента);
	Если НаборКонстант.БЗ_ИдентификаторКлиента = "" Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьИнтерфейс();
КонецПроцедуры
