////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Родитель) Тогда
		Объект.Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Родитель, "Тип");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КатегорииБазыЗнанийЗапись", , Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура АйТи_УровниКомпетенцииТребованияНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.УровниКомпетенции.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Текст, Заголовок", ТекущиеДанные.Требования, "Редактирование требования");  
	ВозвращаемыйКомментарий = Неопределено;
	
	ОП = Новый ОписаниеОповещения("ПослеОкончанияРедактированияТекста", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
	ОткрытьФорму("ОбщаяФорма.РедактированиеТекста", ПараметрыФормы,,,,, ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияТекста(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Если ТекущиеДанные.Требования <> Результат Тогда
			Модифицированность = Истина;
			ТекущиеДанные.Требования = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
