
//+++ АйТи Чекордина И. В. 25.10.2022 ТЗ № НФ00-002433 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=a929fc3497141b3f11ed459119dc64a0Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	МенюКатегории = Параметры.ВерхнееМенюКатегория;
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ЯвляетсяРодителем"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение 	= Истина;
	ЭлементОтбора.Использование 	= Истина;

	ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("Наименование"); 
	ПолеОформления.Использование 	= Истина;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноГрифельноСиний);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,Истина));

КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеДанные = Элементы.Список.ТекущиеДанные;
	Если ВыбранныеДанные.ЯвляетсяРодителем = Истина И МенюКатегории <> "Да" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Можно выбрать только категорию последнего уровня! Детализируйте категорию, нажав на +"; 
		Сообщение.Сообщить();
	Иначе
		ЭтаФорма.Закрыть();
		ОповеститьОВыборе(Значение);
	КонецЕсли;
	
КонецПроцедуры //--- АйТи Чекордина И. В. 25.10.2022 ТЗ № НФ00-002433 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=a929fc3497141b3f11ed459119dc64a0&НаСервере

