
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Исключения") Тогда
		Исключения.ЗагрузитьЗначения(Параметры.Исключения);
		
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
		
		ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка"); 
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке; 
		ЭлементОтбора.ПравоеЗначение 	= Параметры.Исключения;
		ЭлементОтбора.Использование 	= Истина;
		
		ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("Наименование"); 
		ПолеОформления.Использование 	= Истина;
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	КонецЕсли;
	
//+++ АйТи Буков А.С. 19.08.2022 (срочная задача по работе флага "не показывать при выборе")
	ВызовИзСправочникаСотрудники = Параметры.Свойство("ВызовИзСправочникаСотрудники");
	Список.Параметры.УстановитьЗначениеПараметра("ВызовИзСправочникаСотрудники", ВызовИзСправочникаСотрудники);
//--- АйТи Буков А.С. 19.08.2022 (срочная задача по работе флага "не показывать при выборе")

КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если Исключения.НайтиПоЗначению(Значение) <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
