
&НаКлиенте
Процедура КопироватьИЗакрыть(Команда)
	
	УстановитьТекстВБуферОбмена(Ссылка);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоказатьСсылкуНажатие(Элемент)
	
	ДекорацияПоказатьСсылкуНажатиеНаСервере();
	Элементы.ДекорацияПоказатьСсылку.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДекорацияПоказатьСсылкуНажатиеНаСервере()
	
	ОбновитьСсылку();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСсылку()
	
	Если ЗначениеЗаполнено(Объект) Тогда
	
		ТипОбъектаИБ = Объект.Метаданные().ПолноеИмя();
		
		GUIDОбъектаИБ = Объект.УникальныйИдентификатор();
		Ссылка = "";
		Если КопироватьНазвание Тогда
		
			Ссылка = Объект.Наименование + ": ";
		
		КонецЕсли;
		Если ВнешняяСсылка Тогда
		
			Ссылка = Ссылка + ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "#";
			
		КонецЕсли;
		Ссылка = Ссылка + ПолучитьНавигационнуюСсылку(Объект.Ссылка);
		
		Элементы.Ссылка.Видимость = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьТекстВБуферОбмена(Текст) Экспорт
	#Если Клиент Тогда 
		htmlfileОбъект = Новый COMОбъект("htmlfile");
		htmlfileОбъект.ParentWindow.ClipboardData.Setdata("Text", Текст);
		Возврат Текст;
	#КонецЕсли 
КонецФункции

&НаКлиенте
Процедура ВнешняяСсылкаПриИзменении(Элемент)
	ОбновитьСсылку();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьНазваниеПриИзменении(Элемент)
	ОбновитьСсылку();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИзбранноеНажатие(Элемент)
	
	ДекорацияИзбранноеНажатиеНаСервере(Объект);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДекорацияИзбранноеНажатиеНаСервере(ВыбраннаяСтатья)
	
	НавСсылка = ПолучитьНавигационнуюСсылку(ВыбраннаяСтатья);
	
	Избранное = ХранилищеСистемныхНастроек.Загрузить("Общее/ИзбранноеРаботыПользователя");
	Если Избранное <> Неопределено Тогда
		Для каждого Стр из Избранное Цикл
			Если Стр.НавигационнаяСсылка = НавСсылка Тогда
				СтатьяВИзбранном = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры