
Процедура УстановитьУсловноеОформлениеСписка(УсловноеОформлениеЭлементы) Экспорт
	
	ЭлементОформления = УсловноеОформлениеЭлементы.Добавить();              
	ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Меньше; 
	ЭлементОтбора.ПравоеЗначение 	= 0;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СрокИзучения"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Заполнено; 
	ЭлементОтбора.Использование 	= Истина;
	
	ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ПолеОформления.Использование 	= Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ЧО=0; ЧФ='Просроченно на Ч д.'");
	
	
	ЭлементОформления = УсловноеОформлениеЭлементы.Добавить();              
	ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Больше; 
	ЭлементОтбора.ПравоеЗначение 	= 0;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СрокИзучения"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Заполнено; 
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Изучена_Булево"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение 	= Ложь;
	ЭлементОтбора.Использование 	= Истина;
	
	ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ПолеОформления.Использование 	= Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='Осталось на изучение Ч д.'"); 
	
	
	ЭлементОформления = УсловноеОформлениеЭлементы.Добавить();              
	ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение 	= 0;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СрокИзучения"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Заполнено; 
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Изучена_Булево"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение 	= Ложь;
	ЭлементОтбора.Использование 	= Истина;
	
	ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ПолеОформления.Использование 	= Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Сегодня нужно изучить"); 
	
	
	ЭлементОформления = УсловноеОформлениеЭлементы.Добавить();              
	ЭлементыОтбора = ЭлементОформления.Отбор.Элементы;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Больше; 
	ЭлементОтбора.ПравоеЗначение 	= 0;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СрокИзучения"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Заполнено; 
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Изучена_Булево"); 
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение 	= Истина;
	ЭлементОтбора.Использование 	= Истина;
	
	ПолеОформления 					= ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("ДнейНаИзучение"); 
	ПолеОформления.Использование 	= Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='Изучено за Ч д.'");
	
	
КонецПроцедуры
